* problem description
2520 is the smallest number that can be divided by each of the numbers
from 1 to 10 without any remainder.

What is the smallest positive number that is evenly divisible by all
of the numbers from 1 to 20?

* solution
#+begin_src python :results output
  import functools

  def divisible(num, divisor):
      return num % divisor == 0

  def prime_factors(num):
      factors = {}
      i = 2
      while i <= num:
          if divisible(num, i):
              if i not in factors:
                  factors[i] = 1
              else:
                  factors[i] += 1
              num /= i
          else:
              i += 1
      return factors

  factors = {}
  for num in range(1,20)[::-1]:
      num_factors = prime_factors(num)
      for factor in num_factors:
          if factor in factors:
              if factors[factor] < num_factors[factor]:
                  factors[factor] = num_factors[factor]
          else:
              factors[factor] = num_factors[factor]

  print(factors)
  final_number = 1
  for num, times in factors.items():
      final_number *= num ** times

  print(final_number)

  #to10 = functools.reduce(lambda x, y: x*y, [2,2,2,3,3,5,7])
  #
  #for num in range(1,10):
  #    print(f"{to10} mod {num} is {to10%num}")
#+end_src

#+RESULTS:
: {19: 1, 2: 4, 3: 2, 17: 1, 5: 1, 7: 1, 13: 1, 11: 1}
: 232792560
